# Дана строка. Удалите все символы '@' из этой строки.
# Напечатайте изменённую строку
s = input()
print(s.replace('@', ''))
