# Дана строка, состоящая из слов, разделенных пробелами.
# Определите, сколько слов имеет данная строка.
sd = input()
spacebar = sd.count(" ")
print(int(spacebar) +1)
