# Дано целое положительное число.
# Напечатайте "чёт", если число чётное и "нечет", если число нечётное.
n = int(input())
if (n % 2) == 1:
    print('нечет')
else:
    print('чёт')
