#Напишите код, который принимает три целых числа и печатает их сумму.
# Каждое число принимаетсяна отдельной строке.
nam1 = int(input())
nam2 = int(input())
nam3 = int(input())
snam = (nam1 + nam2 + nam3)
print(snam)
