#Напишите код, который принимает имя пользователя и печатает фразу состоящую из
# слов "Привет",запятой, имени пользователя и восклицательного знака.
name = input("Enter your name")
print('Hello, ' + name + ' !')

