#Напишите код, который принимает значения основания и высоты прямоугольного треугольника
# ипечатает его площадь. Каждое число принимается на отдельной строке
nam1 = int(input())
nam2 = int(input())
s = (nam1 * nam2) * 0.5
print(s)

