#Напишите код, который принимает целое число и печатает числа,
# которые следуют до него и посленего.
nam = int(input())
print("The following number for the number " + str(nam) + " : " + str(nam +1))
print("Previous number for number " + str(nam) + " : " + str(nam -1))
